#### 📖 Terraform Plan ('src/notification-hubs/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_monitor_metric_alert.alert_nh_common_anomalous_pns_success_volume will be created
  + resource "azurerm_monitor_metric_alert" "alert_nh_common_anomalous_pns_success_volume" {
      + auto_mitigate            = false
      + description              = "Notification Hub Legacy has an anomalous PNS success volume. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "[IOCOM|NHLegacy] Push Notification Service anomalous success volume"
      + resource_group_name      = "io-p-rg-common"
      + scopes                   = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.NotificationHubs/namespaces/io-p-ntfns-common/notificationHubs/io-p-ntf-common",
        ]
      + severity                 = 1
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/notification-hubs/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + dynamic_criteria {
          + aggregation              = "Total"
          + alert_sensitivity        = "High"
          + evaluation_failure_count = 1
          + evaluation_total_count   = 1
          + metric_name              = "outgoing.allpns.success"
          + metric_namespace         = "Microsoft.NotificationHubs/namespaces/notificationHubs"
          + operator                 = "GreaterThan"
          + skip_metric_validation   = false
        }
    }

  # azurerm_monitor_metric_alert.alert_nh_common_partition_1_anomalous_pns_success_volume will be created
  + resource "azurerm_monitor_metric_alert" "alert_nh_common_partition_1_anomalous_pns_success_volume" {
      + auto_mitigate            = false
      + description              = "Notification Hub Partition 1 has an anomalous PNS success volume. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "[IOCOM|NH1] Push Notification Service anomalous success volume"
      + resource_group_name      = "io-p-rg-common"
      + scopes                   = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.NotificationHubs/namespaces/io-p-ntfns-common-partition-1/notificationHubs/io-p-ntf-common-partition-1",
        ]
      + severity                 = 1
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/notification-hubs/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + dynamic_criteria {
          + aggregation              = "Total"
          + alert_sensitivity        = "High"
          + evaluation_failure_count = 1
          + evaluation_total_count   = 1
          + metric_name              = "outgoing.allpns.success"
          + metric_namespace         = "Microsoft.NotificationHubs/namespaces/notificationHubs"
          + operator                 = "GreaterThan"
          + skip_metric_validation   = false
        }
    }

  # azurerm_monitor_metric_alert.alert_nh_common_partition_1_pns_errors will be created
  + resource "azurerm_monitor_metric_alert" "alert_nh_common_partition_1_pns_errors" {
      + auto_mitigate            = false
      + description              = "Notification Hub Partition 1 incurred in PNS errors, please check. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "[IOCOM|NH1] Push Notification Service errors"
      + resource_group_name      = "io-p-rg-common"
      + scopes                   = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.NotificationHubs/namespaces/io-p-ntfns-common-partition-1/notificationHubs/io-p-ntf-common-partition-1",
        ]
      + severity                 = 1
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/notification-hubs/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + criteria {
          + aggregation            = "Total"
          + metric_name            = "outgoing.allpns.pnserror"
          + metric_namespace       = "Microsoft.NotificationHubs/namespaces/notificationHubs"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 0
        }
    }

  # azurerm_monitor_metric_alert.alert_nh_common_partition_2_anomalous_pns_success_volume will be created
  + resource "azurerm_monitor_metric_alert" "alert_nh_common_partition_2_anomalous_pns_success_volume" {
      + auto_mitigate            = false
      + description              = "Notification Hub Partition 2 has an anomalous PNS success volume. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "[IOCOM|NH2] Push Notification Service anomalous success volume"
      + resource_group_name      = "io-p-rg-common"
      + scopes                   = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.NotificationHubs/namespaces/io-p-ntfns-common-partition-2/notificationHubs/io-p-ntf-common-partition-2",
        ]
      + severity                 = 1
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/notification-hubs/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + dynamic_criteria {
          + aggregation              = "Total"
          + alert_sensitivity        = "High"
          + evaluation_failure_count = 1
          + evaluation_total_count   = 1
          + metric_name              = "outgoing.allpns.success"
          + metric_namespace         = "Microsoft.NotificationHubs/namespaces/notificationHubs"
          + operator                 = "GreaterThan"
          + skip_metric_validation   = false
        }
    }

  # azurerm_monitor_metric_alert.alert_nh_common_partition_2_pns_errors will be created
  + resource "azurerm_monitor_metric_alert" "alert_nh_common_partition_2_pns_errors" {
      + auto_mitigate            = false
      + description              = "Notification Hub Partition 2 incurred in PNS errors, please check. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "[IOCOM|NH2] Push Notification Service errors"
      + resource_group_name      = "io-p-rg-common"
      + scopes                   = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.NotificationHubs/namespaces/io-p-ntfns-common-partition-2/notificationHubs/io-p-ntf-common-partition-2",
        ]
      + severity                 = 1
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/notification-hubs/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + criteria {
          + aggregation            = "Total"
          + metric_name            = "outgoing.allpns.pnserror"
          + metric_namespace       = "Microsoft.NotificationHubs/namespaces/notificationHubs"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 0
        }
    }

  # azurerm_monitor_metric_alert.alert_nh_common_partition_3_anomalous_pns_success_volume will be created
  + resource "azurerm_monitor_metric_alert" "alert_nh_common_partition_3_anomalous_pns_success_volume" {
      + auto_mitigate            = false
      + description              = "Notification Hub Partition 3 has an anomalous PNS success volume. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "[IOCOM|NH3] Push Notification Service anomalous success volume"
      + resource_group_name      = "io-p-rg-common"
      + scopes                   = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.NotificationHubs/namespaces/io-p-ntfns-common-partition-3/notificationHubs/io-p-ntf-common-partition-3",
        ]
      + severity                 = 1
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/notification-hubs/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + dynamic_criteria {
          + aggregation              = "Total"
          + alert_sensitivity        = "High"
          + evaluation_failure_count = 1
          + evaluation_total_count   = 1
          + metric_name              = "outgoing.allpns.success"
          + metric_namespace         = "Microsoft.NotificationHubs/namespaces/notificationHubs"
          + operator                 = "GreaterThan"
          + skip_metric_validation   = false
        }
    }

  # azurerm_monitor_metric_alert.alert_nh_common_partition_3_pns_errors will be created
  + resource "azurerm_monitor_metric_alert" "alert_nh_common_partition_3_pns_errors" {
      + auto_mitigate            = false
      + description              = "Notification Hub Partition 3 incurred in PNS errors, please check. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "[IOCOM|NH3] Push Notification Service errors"
      + resource_group_name      = "io-p-rg-common"
      + scopes                   = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.NotificationHubs/namespaces/io-p-ntfns-common-partition-3/notificationHubs/io-p-ntf-common-partition-3",
        ]
      + severity                 = 1
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/notification-hubs/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + criteria {
          + aggregation            = "Total"
          + metric_name            = "outgoing.allpns.pnserror"
          + metric_namespace       = "Microsoft.NotificationHubs/namespaces/notificationHubs"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 0
        }
    }

  # azurerm_monitor_metric_alert.alert_nh_common_partition_4_anomalous_pns_success_volume will be created
  + resource "azurerm_monitor_metric_alert" "alert_nh_common_partition_4_anomalous_pns_success_volume" {
      + auto_mitigate            = false
      + description              = "Notification Hub Partition 4 has an anomalous PNS success volume. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "[IOCOM|NH4] Push Notification Service anomalous success volume"
      + resource_group_name      = "io-p-rg-common"
      + scopes                   = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.NotificationHubs/namespaces/io-p-ntfns-common-partition-4/notificationHubs/io-p-ntf-common-partition-4",
        ]
      + severity                 = 1
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/notification-hubs/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + dynamic_criteria {
          + aggregation              = "Total"
          + alert_sensitivity        = "High"
          + evaluation_failure_count = 1
          + evaluation_total_count   = 1
          + metric_name              = "outgoing.allpns.success"
          + metric_namespace         = "Microsoft.NotificationHubs/namespaces/notificationHubs"
          + operator                 = "GreaterThan"
          + skip_metric_validation   = false
        }
    }

  # azurerm_monitor_metric_alert.alert_nh_common_partition_4_pns_errors will be created
  + resource "azurerm_monitor_metric_alert" "alert_nh_common_partition_4_pns_errors" {
      + auto_mitigate            = false
      + description              = "Notification Hub Partition 4 incurred in PNS errors, please check. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "[IOCOM|NH4] Push Notification Service errors"
      + resource_group_name      = "io-p-rg-common"
      + scopes                   = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.NotificationHubs/namespaces/io-p-ntfns-common-partition-4/notificationHubs/io-p-ntf-common-partition-4",
        ]
      + severity                 = 1
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/notification-hubs/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + criteria {
          + aggregation            = "Total"
          + metric_name            = "outgoing.allpns.pnserror"
          + metric_namespace       = "Microsoft.NotificationHubs/namespaces/notificationHubs"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 0
        }
    }

  # azurerm_monitor_metric_alert.alert_nh_common_pns_errors will be created
  + resource "azurerm_monitor_metric_alert" "alert_nh_common_pns_errors" {
      + auto_mitigate            = false
      + description              = "Notification Hub Legacy incurred in PNS errors, please check. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "[IOCOM|NHLegacy] Push Notification Service errors"
      + resource_group_name      = "io-p-rg-common"
      + scopes                   = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.NotificationHubs/namespaces/io-p-ntfns-common/notificationHubs/io-p-ntf-common",
        ]
      + severity                 = 1
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/notification-hubs/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + criteria {
          + aggregation            = "Total"
          + metric_name            = "outgoing.allpns.pnserror"
          + metric_namespace       = "Microsoft.NotificationHubs/namespaces/notificationHubs"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 0
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
